/*
 * Copyright (c) 2002-2004 Apple Computer, Inc. All rights reserved.
 *
 * @APPLE_LICENSE_HEADER_START@
 * 
 * This file contains Original Code and/or Modifications of Original Code
 * as defined in and that are subject to the Apple Public Source License
 * Version 2.0 (the 'License'). You may not use this file except in
 * compliance with the License. Please obtain a copy of the License at
 * http://www.opensource.apple.com/apsl/ and read it before using this
 * file.
 * 
 * The Original Code and all software distributed under the License are
 * distributed on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER
 * EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
 * INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT.
 * Please see the License for the specific language governing rights and
 * limitations under the License.
 * 
 * @APPLE_LICENSE_HEADER_END@

    Change History (most recent first):
    
$Log: DNSServices.h,v $
Revision 1.11  2004/07/13 21:24:28  rpantos
Fix for <rdar://problem/3701120>.

Revision 1.10  2004/01/30 02:56:34  bradley
Updated to support full Unicode display. Added support for all services on www.dns-sd.org.

Revision 1.9  2003/10/31 12:16:03  bradley
Added support for providing the resolved host name to the callback.

Revision 1.8  2003/08/20 06:44:24  bradley

registration record updates (e.g. TXT record updates); Added support for using either a single C
string TXT record, a raw, pre-formatted TXT record potentially containing multiple character string
entries, or a C-string containing a Mac OS X-style \001-delimited set of TXT record character
strings; Added support in resolve callbacks for providing both a simplified C-string for TXT records
and a ptr/size for the raw TXT record data; Added utility routines for dynamically building TXT
records from a variety of sources (\001-delimited, individual strings, etc.) and converting TXT
records to various formats for use in apps; Added utility routines to validate DNS names, DNS
service types, and TXT records; Moved to portable address representation unions (byte-stream vs host
order integer) for consistency, to avoid swapping between host and network byte order, and for IPv6
support; Removed dependence on modified mDNSCore: define structures and prototypes locally; Added
support for automatically renaming services on name conflicts; Detect and correct TXT records from
old versions of mDNS that treated a TXT record as an arbitrary block of data, but prevent other
malformed TXT records from being accepted; Added many more error codes; Added complete HeaderDoc for
all constants, structures, typedefs, macros, and functions. Various other minor cleanup and fixes.

Revision 1.7  2003/08/12 19:56:29  cheshire
Update to APSL 2.0

Revision 1.6  2003/07/02 21:20:10  cheshire
<rdar://problem/3313413> Update copyright notices, etc., in source code comments

Revision 1.5  2003/03/22 02:57:45  cheshire
Updated mDNSWindows to use new "mDNS_Execute" model (see "mDNSCore/Implementer Notes.txt")

Revision 1.4  2003/02/20 00:59:05  cheshire
Brought Windows code up to date so it complies with
Josh Graessley's interface changes for IPv6 support.
(Actual support for IPv6 on Windows will come later.)

Revision 1.3  2002/09/21 20:44:57  zarzycki
Added APSL info

Revision 1.2  2002/09/20 05:58:02  bradley
DNS Services for Windows

*/

//---------------------------------------------------------------------------------------------------------------------------
/*!	@header		DNSServices
	
	@abstract	DNS Services interfaces.
	
	@discussion	
	
	DNS Services provides DNS service registration, domain and service discovery, and name resolving services.
*/

#ifndef	__DNS_SERVICES__
#define	__DNS_SERVICES__

#include	<stddef.h>

#ifdef	__cplusplus
	extern "C" {
#endif

#if 0
#pragma mark == General ==
#endif

//---------------------------------------------------------------------------------------------------------------------------
/*!	@defined	dns_check_compile_time
	
	@abstract	Performs a compile-time check of something such as the size of an int.
	
	@discussion	
	
	This declares a unique array with a size that is determined by dividing 1 by the result of the compile-time expression 
	passed to the macro. If the expression evaluates to 0, this expression results in a divide by zero, which is illegal 
	and generates a compile-time error.

	For example:
	
	dns_check_compile_time( sizeof( int ) == 4 );
	
	Note: This only works with compile-time expressions.
	Note: This only works in places where extern declarations are allowed (e.g. global scope).
	
	References:
	
	<http://www.jaggersoft.com/pubs/CVu11_3.html>
	<http://www.jaggersoft.com/pubs/CVu11_5.html>
	
	Note: The following macros differ from the macros on the www.jaggersoft.com web site because those versions do not
	work with GCC due to GCC allow a zero-length array. Using a divide-by-zero condition turned out to be more portable.
*/

#define	dns_check_compile_time( X )		extern int dns_unique_name[ 1 / (int)( ( X ) ) ]

#define	dns_unique_name					dns_make_name_wrapper( __LINE__ )
#define	dns_make_name_wrapper( X )		dns_make_name( X )
#define	dns_make_name( X )				dns_check_compile_time_ ## X

//---------------------------------------------------------------------------------------------------------------------------
/*!	@defined	dns_check_compile_time_code
	
	@abstract	Perform a compile-time check, suitable for placement in code, of something such as the size of an int.
	
	@discussion	
	
	This creates a switch statement with an existing case for 0 and an additional case using the result of a 
	compile-time expression. A switch statement cannot have two case labels with the same constant so if the
	compile-time expression evaluates to 0, it is illegal and generates a compile-time error. If the compile-time
	expression does not evaluate to 0, the resulting value is used as the case label and it compiles without error.

	For example:
	
	dns_check_compile_time_code( sizeof( int ) == 4 );
	
	Note: This only works with compile-time expressions.
	Note: This does not work in a global scope so it must be inside a function.
	
	References:
	
	<http://www.jaggersoft.com/pubs/CVu11_3.html>
	<http://www.jaggersoft.com/pubs/CVu11_5.html>
*/

#define	dns_check_compile_time_code( X )	switch( 0 ) { case 0: case X:; }

//---------------------------------------------------------------------------------------------------------------------------
/*!	@defined	DNS_LOCAL
	
	@abstract	Macro to make variables and functions static when debugging is off, but exported when debugging is on.
	
	@discussion	
	
	Rather than using "static" directly, using this macros allows you to access these variables external while 
	debugging without being penalized for production builds.
*/

#if( DEBUG )
	#define	DNS_LOCAL
#else
	#define	DNS_LOCAL	static
#endif

//---------------------------------------------------------------------------------------------------------------------------
/*!	@defined	DNS_EXPORT
	
	@abstract	Macro to provide a visual clue that a variable or function is globally visible.
*/

#define	DNS_EXPORT

//---------------------------------------------------------------------------------------------------------------------------
/*!	@defined	DNS_DEBUG_USE_ONLY
	@abstract	Macro to mark a variable as unused when debugging is turned off.
	@discussion	
	
	Variables are sometimes needed only for debugging. When debugging is turned off, these debug-only variables
	generate compiler warnings about unused variables. To eliminate these warnings, use the DNS_DEBUG_USE_ONLY macro 
	to indicate the variables are for debugging only.
*/

#if( DEBUG )
	#define	DNS_DEBUG_USE_ONLY( X )
#else
	#define	DNS_DEBUG_USE_ONLY( X )		(void)( X )
#endif

//---------------------------------------------------------------------------------------------------------------------------
/*!	@defined	DNS_UNUSED
	@abstract	Macro to mark a variable as unused.
	@discussion	
	
	There is no universally supported pragma/attribute for indicating a variable is unused. DNS_UNUSED lets 
	indicate a variable is unused in a manner that is supported by most compilers.
*/

#define	DNS_UNUSED( X )			(void)( X )

//---------------------------------------------------------------------------------------------------------------------------
/*!	@typedef	DNSUInt8

	@abstract	8-bit unsigned data type.
*/

typedef unsigned char		DNSUInt8;

dns_check_compile_time( sizeof( DNSUInt8 ) == 1 );

//---------------------------------------------------------------------------------------------------------------------------
/*!	@typedef	DNSUInt16

	@abstract	16-bit unsigned data type.
*/

typedef unsigned short		DNSUInt16;

dns_check_compile_time( sizeof( DNSUInt16 ) == 2 );

//---------------------------------------------------------------------------------------------------------------------------
/*!	@typedef	DNSUInt32

	@abstract	32-bit unsigned data type.
*/

typedef unsigned long		DNSUInt32;

dns_check_compile_time( sizeof( DNSUInt32 ) == 4 );

//---------------------------------------------------------------------------------------------------------------------------
/*!	@typedef	DNSSInt32

	@abstract	32-bit signed data type.
*/

typedef signed long		DNSSInt32;

dns_check_compile_time( sizeof( DNSSInt32 ) == 4 );


//---------------------------------------------------------------------------------------------------------------------------
/*!	@typedef	DNSOpaque16

	@abstract	16-bit opaque data type with 8-bit and 16-bit accessors.
*/

typedef union DNSOpaque16	DNSOpaque16;
union	DNSOpaque16
{
	DNSUInt8		v8[ 2 ];
	DNSUInt16		v16;
};

//---------------------------------------------------------------------------------------------------------------------------
/*!	@typedef	DNSOpaque32

	@abstract	32-bit opaque data type with 8-bit, 16-bit, and 32-bit accessors.
*/

typedef union DNSOpaque32	DNSOpaque32;
union	DNSOpaque32
{
	DNSUInt8		v8[ 4 ];
	DNSUInt16		v16[ 2 ];
	DNSUInt32		v32;
};

//---------------------------------------------------------------------------------------------------------------------------
/*!	@typedef	DNSOpaque128

	@abstract	128-bit opaque data type with 8-bit, 16-bit, and 32-bit accessors.
*/

