/*
	Copyright (c) 2016-2020 Apple Inc. All rights reserved.
*/

#ifndef	__DNSMessage_h
#define	__DNSMessage_h

#include <CoreUtils/CommonServices.h>

CU_ASSUME_NONNULL_BEGIN

__BEGIN_DECLS

//---------------------------------------------------------------------------------------------------------------------------
/*!	@group		DNS domain name size limits
	
	@discussion See <https://tools.ietf.org/html/rfc1035#section-2.3.4>.
*/
#define kDomainLabelLengthMax		63
#define kDomainNameLengthMax		256	// For compatibility with mDNS. See <https://tools.ietf.org/html/rfc6762#appendix-C>.

//---------------------------------------------------------------------------------------------------------------------------
/*!	@group		DNS message header
*/
typedef struct
{
	uint8_t		id[ 2 ];
	uint8_t		flags[ 2 ];
	uint8_t		questionCount[ 2 ];
	uint8_t		answerCount[ 2 ];
	uint8_t		authorityCount[ 2 ];
	uint8_t		additionalCount[ 2 ];
	
}	DNSHeader;

#define kDNSHeaderLength		12
check_compile_time( sizeof( DNSHeader ) == kDNSHeaderLength );

#define DNSHeaderGetID( HDR )					ReadBig16( ( HDR )->id )
#define DNSHeaderGetFlags( HDR )				ReadBig16( ( HDR )->flags )
#define DNSHeaderGetQuestionCount( HDR )		ReadBig16( ( HDR )->questionCount )
#define DNSHeaderGetAnswerCount( HDR )			ReadBig16( ( HDR )->answerCount )
#define DNSHeaderGetAuthorityCount( HDR )		ReadBig16( ( HDR )->authorityCount )
#define DNSHeaderGetAdditionalCount( HDR )		ReadBig16( ( HDR )->additionalCount )

#define DNSHeaderSetID( HDR, X )					WriteBig16( ( HDR )->id, (X) )
#define DNSHeaderSetFlags( HDR, X )					WriteBig16( ( HDR )->flags, (X) )
#define DNSHeaderSetQuestionCount( HDR, X )			WriteBig16( ( HDR )->questionCount, (X) )
#define DNSHeaderSetAnswerCount( HDR, X )			WriteBig16( ( HDR )->answerCount, (X) )
#define DNSHeaderSetAuthorityCount( HDR, X )		WriteBig16( ( HDR )->authorityCount, (X) )
#define DNSHeaderSetAdditionalCount( HDR, X )		WriteBig16( ( HDR )->additionalCount, (X) )

// Single-bit DNS header fields

#define kDNSHeaderFlag_Response					( 1U << 15 )	// QR (bit 15), Query (0)/Response (1)
#define kDNSHeaderFlag_AuthAnswer				( 1U << 10 )	// AA (bit 10), Authoritative Answer
#define kDNSHeaderFlag_Truncation				( 1U <<  9 )	// TC (bit  9), TrunCation
#define kDNSHeaderFlag_RecursionDesired			( 1U <<  8 )	// RD (bit  8), Recursion Desired
#define kDNSHeaderFlag_RecursionAvailable		( 1U <<  7 )	// RA (bit  7), Recursion Available
#define kDNSHeaderFlag_Z						( 1U <<  6 )	//  Z (bit  6), Reserved (must be zero)
#define kDNSHeaderFlag_AuthenticData			( 1U <<  5 )	// AD (bit  5), Authentic Data (RFC 2535, Section 6)
#define kDNSHeaderFlag_CheckingDisabled			( 1U <<  4 )	// CD (bit  4), Checking Disabled (RFC 2535, Section 6)

// OPCODE (bits 14-11), Operation Code

#define DNSFlagsGetOpCode( FLAGS )		( ( (FLAGS) >> 11 ) & 0x0FU )
#define DNSFlagsSetOpCode( FLAGS, OPCODE ) \
		do { (FLAGS) = ( (FLAGS) & ~0x7800U ) | ( ( (OPCODE) & 0x0FU ) << 11 ); } while( 0 )

#define kDNSOpCode_Query			0	// QUERY (standard query)
#define kDNSOpCode_InverseQuery		1	// IQUERY (inverse query)
#define kDNSOpCode_Status			2	// STATUS
#define kDNSOpCode_Notify			4	// NOTIFY
#define kDNSOpCode_Update			5	// UPDATE

// RCODE (bits 3-0), Response Code

#define DNSFlagsGetRCode( FLAGS )				( (FLAGS) & 0x0FU )
#define DNSFlagsSetRCode( FLAGS, RCODE ) \
	do { (FLAGS) = ( (FLAGS) & ~0x000FU ) | ( ( (unsigned int)(RCODE) ) & 0x0FU ); } while( 0 )

//---------------------------------------------------------------------------------------------------------------------------
/*!	@group		Multicast DNS Constants
*/

#define kMDNSClassUnicastResponseBit		( 1U << 15 ) // See <https://tools.ietf.org/html/rfc6762#section-18.12>.
#define kMDNSClassCacheFlushBit				( 1U << 15 ) // See <https://tools.ietf.org/html/rfc6762#section-18.13>.

//---------------------------------------------------------------------------------------------------------------------------
/*!	@group		Misc. DNS message data structures
*/

#define _DNSMessageGet8( PTR )			Read8( PTR )
#define _DNSMessageGet16( PTR )			ReadBig16( PTR )
#define _DNSMessageGet32( PTR )			ReadBig32( PTR )
#define _DNSMessageSet8( PTR, X )		Write8( PTR, X )
#define _DNSMessageSet16( PTR, X )		WriteBig16( PTR, X )
#define _DNSMessageSet32( PTR, X )		WriteBig32( PTR, X )

#define dns_fields_define_accessors( PREFIX, TYPE, FIELD, BIT_SIZE )	\
	STATIC_INLINE uint ## BIT_SIZE ## _t								\
		dns_ ## PREFIX ## _ ## TYPE ## _get_ ## FIELD (					\
			const dns_ ## PREFIX ## _ ## TYPE *	inFields )				\
	{																	\
		return _DNSMessageGet ## BIT_SIZE ( inFields->FIELD );			\
	}																	\
																		\
	STATIC_INLINE void													\
		dns_ ## PREFIX ## _ ## TYPE ## _set_ ## FIELD (					\
			dns_ ## PREFIX ## _ ## TYPE *	inFields,					\
			uint ## BIT_SIZE ## _t			inValue )					\
	{																	\
		_DNSMessageSet ## BIT_SIZE ( inFields->FIELD, inValue );		\
	}																	\
	check_compile_time( ( sizeof_field( dns_ ## PREFIX ## _ ## TYPE, FIELD ) * 8 ) == (BIT_SIZE) )

#define dns_fixed_fields_define_accessors( TYPE, FIELD, BIT_SIZE ) \
	dns_fields_define_accessors( fixed_fields, TYPE, FIELD, BIT_SIZE )

#define dns_dnskey_fields_define_accessors( TYPE, FIELD, BIT_SIZE ) \
	dns_fields_define_accessors( dnskey, TYPE, FIELD, BIT_SIZE )

#define dns_ds_fields_define_accessors( TYPE, FIELD, BIT_SIZE ) \
	dns_fields_define_accessors( ds, TYPE, FIELD, BIT_SIZE )

// DNS question fixed-length fields
// See <https://tools.ietf.org/html/rfc1035#section-4.1.2>

typedef struct
{
	uint8_t		type[ 2 ];
	uint8_t		class[ 2 ];
	
}	dns_fixed_fields_question;

check_compile_time( sizeof( dns_fixed_fields_question ) == 4 );

dns_fixed_fields_define_accessors( question, type,  16 );
dns_fixed_fields_define_accessors( question, class, 16 );

STATIC_INLINE void
	dns_fixed_fields_question_init(
		dns_fixed_fields_question *	inFields,
		uint16_t					inQType,
		uint16_t					inQClass )
{
	dns_fixed_fields_question_set_type( inFields, inQType );
	dns_fixed_fields_question_set_class( inFields, inQClass );
}

// DNS resource record fixed-length fields
// See <https://tools.ietf.org/html/rfc1035#section-4.1.3>

typedef struct
{
	uint8_t		type[ 2 ];
	uint8_t		class[ 2 ];
	uint8_t		ttl[ 4 ];
	uint8_t		rdlength[ 2 ];
	
}	dns_fixed_fields_record;

check_compile_time( sizeof( dns_fixed_fields_record ) == 10 );

dns_fixed_fields_define_accessors( record, type,     16 );
dns_fixed_fields_define_accessors( record, class,    16 );
dns_fixed_fields_define_accessors( record, ttl,      32 );
dns_fixed_fields_define_accessors( record, rdlength, 16 );

STATIC_INLINE void
	dns_fixed_fields_record_init(
		dns_fixed_fields_record *	inFields,
		uint16_t					inType,
		uint16_t					inClass,
		uint32_t					inTTL,
		uint16_t					inRDLength )
{
	dns_fixed_fields_record_set_type( inFields, inType );
	dns_fixed_fields_record_set_class( inFields, inClass );
	dns_fixed_fields_record_set_ttl( inFields, inTTL );
	dns_fixed_fields_record_set_rdlength( inFields, inRDLength );
}

// DNS SRV record data fixed-length fields
// See <https://tools.ietf.org/html/rfc2782>

typedef struct
{
	uint8_t		priority[ 2 ];
	uint8_t		weight[ 2 ];
	uint8_t		port[ 2 ];
	
}	dns_fixed_fields_srv;

check_compile_time( sizeof( dns_fixed_fields_srv ) == 6 );

dns_fixed_fields_define_accessors( srv, priority, 16 );
dns_fixed_fields_define_accessors( srv, weight,   16 );
dns_fixed_fields_define_accessors( srv, port,     16 );

STATIC_INLINE void
	dns_fixed_fields_srv_init(
		dns_fixed_fields_srv *	inFields,
		uint16_t				inPriority,
		uint16_t				inWeight,
		uint16_t				inPort )
{
	dns_fixed_fields_srv_set_priority( inFields, inPriority );
	dns_fixed_fields_srv_set_weight( inFields, inWeight );
	dns_fixed_fields_srv_set_port( inFields, inPort );
}

// DNS SOA record data fixed-length fields
// See <https://tools.ietf.org/html/rfc1035#section-3.3.13>

typedef struct
{
	uint8_t		serial[ 4 ];
	uint8_t		refresh[ 4 ];
	uint8_t		retry[ 4 ];
	uint8_t		expire[ 4 ];
	uint8_t		minimum[ 4 ];
	
}	dns_fixed_fields_soa;

check_compile_time( sizeof( dns_fixed_fields_soa ) == 20 );

dns_fixed_fields_define_accessors( soa, serial,  32 );
dns_fixed_fields_define_accessors( soa, refresh, 32 );
dns_fixed_fields_define_accessors( soa, retry,   32 );
dns_fixed_fields_define_accessors( soa, expire,  32 );
dns_fixed_fields_define_accessors( soa, minimum, 32 );

STATIC_INLINE void
	dns_fixed_fields_soa_init(
		dns_fixed_fields_soa *	inFields,
		uint32_t				inSerial,
		uint32_t				inRefresh,
		uint32_t				inRetry,
		uint32_t				inExpire,
		uint32_t				inMinimum )
{
	dns_fixed_fields_soa_set_serial( inFields, inSerial );
	dns_fixed_fields_soa_set_refresh( inFields, inRefresh );
	dns_fixed_fields_soa_set_retry( inFields, inRetry );
	dns_fixed_fields_soa_set_expire( inFields, inExpire );
	dns_fixed_fields_soa_set_minimum( inFields, inMinimum );
}

// OPT pseudo-resource record fixed-length fields without RDATA
// See <https://tools.ietf.org/html/rfc6891#section-6.1.2>

typedef struct
{
	uint8_t		name[ 1 ];
	uint8_t		type[ 2 ];
	uint8_t		udp_payload_size[ 2 ];
	uint8_t		extended_rcode[ 1 ];
	uint8_t		version[ 1 ];
	uint8_t		extended_flags[ 2 ];
	uint8_t		rdlen[ 2 ];
	
}	dns_fixed_fields_opt;

check_compile_time( sizeof( dns_fixed_fields_opt ) == 11 );

#define kDNSExtendedFlag_DNSSECOK		( 1U << 15 ) // <https://tools.ietf.org/html/rfc3225#section-3>

dns_fixed_fields_define_accessors( opt, name,              8 );
dns_fixed_fields_define_accessors( opt, type,             16 );
dns_fixed_fields_define_accessors( opt, udp_payload_size, 16 );
dns_fixed_fields_define_accessors( opt, extended_rcode,    8 );
dns_fixed_fields_define_accessors( opt, version,           8 );
dns_fixed_fields_define_accessors( opt, extended_flags,   16 );
dns_fixed_fields_define_accessors( opt, rdlen,            16 );

// OPT pseudo-resource record fixed-length fields with OPTION-CODE and OPTION-LENGTH
// See <https://tools.ietf.org/html/rfc6891#section-6.1.2>

typedef struct
{
	uint8_t		name[ 1 ];
	uint8_t		type[ 2 ];
	uint8_t		udp_payload_size[ 2 ];
	uint8_t		extended_rcode[ 1 ];
	uint8_t		version[ 1 ];
	uint8_t		extended_flags[ 2 ];
	uint8_t		rdlen[ 2 ];
	uint8_t		option_code[ 2 ];
	uint8_t		option_length[ 2 ];
	
}	dns_fixed_fields_opt1;

check_compile_time( sizeof( dns_fixed_fields_opt1 ) == 15 );

dns_fixed_fields_define_accessors( opt1, name,              8 );
dns_fixed_fields_define_accessors( opt1, type,             16 );
dns_fixed_fields_define_accessors( opt1, udp_payload_size, 16 );
dns_fixed_fields_define_accessors( opt1, extended_rcode,    8 );
dns_fixed_fields_define_accessors( opt1, version,           8 );
dns_fixed_fields_define_accessors( opt1, extended_flags,   16 );
dns_fixed_fields_define_accessors( opt1, rdlen,            16 );
dns_fixed_fields_define_accessors( opt1, option_code,      16 );
dns_fixed_fields_define_accessors( opt1, option_length,    16 );

// OPT pseudo-resource record RDATA option fixed-length fields
// See <https://tools.ietf.org/html/rfc6891#section-6.1.2>

typedef struct
{
	uint8_t		code[ 2 ];
	uint8_t		length[ 2 ];
	
}	dns_fixed_fields_option;

check_compile_time( sizeof( dns_fixed_fields_option ) == 4 );

dns_fixed_fields_define_accessors( option, code,   16 );
dns_fixed_fields_define_accessors( option, length, 16 );

// DNS DNSKEY record data fixed-length fields
// See <https://tools.ietf.org/html/rfc4034#section-2.1>

typedef struct
{
	uint8_t		flags[ 2 ];
	uint8_t		protocol[ 1 ];
	uint8_t		algorithm[ 1 ];
	
}	dns_fixed_fields_dnskey;

check_compile_time( sizeof( dns_fixed_fields_dnskey ) == 4 );

dns_fixed_fields_define_accessors( dnskey, flags,     16 );
dns_fixed_fields_define_accessors( dnskey, protocol,   8 );
dns_fixed_fields_define_accessors( dnskey, algorithm,  8 );

#define kDNSKeyFlag_ZoneKey		( 1U << ( 15 -  7 ) )	// MSB bit 7  <https://tools.ietf.org/html/rfc4034#section-2.1.1>
#define kDNSKeyFlag_SEP			( 1U << ( 15 - 15 ) )	// MSB bit 15 <https://tools.ietf.org/html/rfc4034#section-2.1.1>

#define kDNSKeyProtocol_DNSSEC		3	// Protocol value must be 3. <https://tools.ietf.org/html/rfc4034#section-2.1.2>

// DNSSEC Algoritm Numbers
// See <https://www.iana.org/assignments/dns-sec-alg-numbers/dns-sec-alg-numbers.xhtml#dns-sec-alg-numbers-1>

#define kDNSSECAlgorithm_RSASHA1			 5	// RSA/SHA-1
#define kDNSSECAlgorithm_RSASHA256			 8	// RSA/SHA-256
#define kDNSSECAlgorithm_RSASHA512			10	// RSA/SHA-512
#define kDNSSECAlgorithm_ECDSAP256SHA256	13	// ECDSA P-256 curve/SHA-256
#define kDNSSECAlgorithm_ECDSAP384SHA384	14	// ECDSA P-384 curve/SHA-384
#define kDNSSECAlgorithm_Ed25519			15	// Ed25519

// DNS RRSIG record data fixed-length fields
// See <https://tools.ietf.org/html/rfc4034#section-3.1>

typedef struct
{
	uint8_t		type_covered[ 2 ];
	uint8_t		algorithm[ 1 ];
	uint8_t		labels[ 1 ];
	uint8_t		original_ttl[ 4 ];
	uint8_t		signature_expiration[ 4 ];
	uint8_t		signature_inception[ 4 ];
	uint8_t		key_tag[ 2 ];
	
}	dns_fixed_fields_rrsig;

check_compile_time( sizeof( dns_fixed_fields_rrsig ) == 18 );

dns_fixed_fields_define_accessors( rrsig, type_covered,         16 );
dns_fixed_fields_define_accessors( rrsig, algorithm,             8 );
dns_fixed_fields_define_accessors( rrsig, labels,                8 );
dns_fixed_fields_define_accessors( rrsig, original_ttl,         32 );
dns_fixed_fields_define_accessors( rrsig, signature_expiration, 32 );
dns_fixed_fields_define_accessors( rrsig, signature_inception,  32 );
dns_fixed_fields_define_accessors( rrsig, key_tag,              16 );

// DNS DS record data fixed-length fields
// See <https://tools.ietf.org/html/rfc4034#section-5.1>

typedef struct
{
	uint8_t		key_tag[ 2 ];
	uint8_t		algorithm[ 1 ];
	uint8_t		digest_type[ 1 ];
	
}	dns_fixed_fields_ds;

check_compile_time( sizeof( dns_fixed_fields_ds ) == 4 );

dns_fixed_fields_define_accessors( ds, key_tag,     16 );
dns_fixed_fields_define_accessors( ds, algorithm,    8 );
dns_fixed_fields_define_accessors( ds, digest_type,  8 );

#define kDSDigestType_SHA1			1	// SHA-1   <https://tools.ietf.org/html/rfc4034#appendix-A.2>
#define kDSDigestType_SHA256		2	// SHA-256 <https://tools.ietf.org/html/rfc4509#section-5>

// DNS DS record data
// See <https://tools.ietf.org/html/rfc4509#section-2.2>

typedef struct
{
	uint8_t		key_tag[ 2 ];
	uint8_t		algorithm[ 1 ];
	uint8_t		digest_type[ 1 ];
	uint8_t		digest[ 32 ];
	
}	dns_ds_sha256;

check_compile_time( sizeof( dns_ds_sha256 ) == 36 );

dns_ds_fields_define_accessors( sha256, key_tag,     16 );
dns_ds_fields_define_accessors( sha256, algorithm,    8 );
dns_ds_fields_define_accessors( sha256, digest_type,  8 );

// DNS NSEC3 record data fixed-length fields
// See <https://tools.ietf.org/html/rfc5155#section-3.2>

typedef struct
{
	uint8_t		hash_alg[ 1 ];
	uint8_t		flags[ 1 ];
	uint8_t		iterations[ 2 ];
	
}	dns_fixed_fields_nsec3;

check_compile_time( sizeof( dns_fixed_fields_nsec3 ) == 4 );

dns_fixed_fields_define_accessors( nsec3, hash_alg,    8 );
dns_fixed_fields_define_accessors( nsec3, flags,       8 );
dns_fixed_fields_define_accessors( nsec3, iterations, 16 );

// DNS SVCB record data fixed-length fields
// See <https://tools.ietf.org/html/draft-ietf-dnsop-svcb-https-00#section-2.2>

typedef struct
{
	uint8_t		priority[ 2 ];
	
}	dns_fixed_fields_svcb;

check_compile_time( sizeof( dns_fixed_fields_svcb ) == 2 );

dns_fixed_fields_define_accessors( svcb, priority, 16 );

typedef struct
{
	uint8_t		key[ 2 ];
	uint8_t		value_length[ 2 ];
	
}	dns_fixed_fields_svcb_param;

check_compile_time( sizeof( dns_fixed_fields_svcb_param ) == 4 );

dns_fixed_fields_define_accessors( svcb_param, key,          16 );
dns_fixed_fields_define_accessors( svcb_param, value_length, 16 );

//---------------------------------------------------------------------------------------------------------------------------
/*!	@group		DNS record types
*/
// This code was autogenerated on 2020-06-30 by dns-rr-func-autogen version 1.3
// Data source URL: https://www.iana.org/assignments/dns-parameters/dns-parameters-4.csv
// Overrides: none

typedef enum
{
	kDNSRecordType_A          = 1,
	kDNSRecordType_NS         = 2,
	kDNSRecordType_MD         = 3,
	kDNSRecordType_MF         = 4,
	kDNSRecordType_CNAME      = 5,
	kDNSRecordType_SOA        = 6,
	kDNSRecordType_MB         = 7,
	kDNSRecordType_MG         = 8,
	kDNSRecordType_MR         = 9,
	kDNSRecordType_NULL       = 10,
	kDNSRecordType_WKS        = 11,
	kDNSRecordType_PTR        = 12,
	kDNSRecordType_HINFO      = 13,
